x1=[200,180,160,140,120,100,80,60,40,20,0 ];
y1=[3.5, 3.4,3.2,3.0,2.9,2.7,2.6,2.4,2.3,2.1,2.0];
x2=[200,180,160,140,120,100,80,60,40,20,0];
y2=[149.8,149.5,149.3,149.1,148.8,148.6,148.4,148.2,147.9,147.7,147.5];
[AX]=plotyy(x1,y1,x2,y2); %#ok<PLOTYY>
set(get(AX(1),'ylabel'),'string','U1/(mV)');
set(get(AX(2),'ylabel'),'string','U2/(mV)');
xlabel('I/(mA)');
title('不同磁偏置条件下U-I图像');
set(AX(1),'XDir','reverse');  
set(AX(2),'XDir','reverse');  
set(AX(1),'ylim',[0,5],'ytick',[0:0.5:5]');
set(AX(2),'ylim',[145,150],'ytick',[145:0.5:150]);
grid on;